# Create Method (XYZ, ElementId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Point..::..Create Method (XYZ, ElementId)
Point Class See Also
---
Creates a point at the given coordinates and assigns it the specified GraphicsStyle.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static Point Create(
	XYZ coord,
	ElementId id
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	coord As XYZ, _
	id As ElementId _
) As Point
```

Visual C++
---
```text
public:
static Point^ Create(
	XYZ^ coord,
	ElementId^ id
)
```

# ### Parameters
coord
    Type: Autodesk.Revit.DB..::..XYZ The coordinates where the point will be created.
id
    Type: Autodesk.Revit.DB..::..ElementId The id of the GraphicsStyle element from which to apply the point properties.
# ### Return Value
A Point object.
# See Also
Point Class
Create Overload
Autodesk.Revit.DB Namespace